#include <stdio.h>

void main() {

	//Ex2-3
	//Ex2-4
	//Ex2-5
	//Ex2-7
	//Ex2-8
	//Ex2-9
	//Ex2-10


	//문제1.
	//printf("이종원\n이 종 원\n이  종  원");

	//문제2.
	//printf("이름: 이종원\n");
	//printf("주소: 서울시 노원구 덕릉로 70가길 21\n");
	//printf("전화번호: 010-1234-5678\n");

	//문제3.
	//printf("제 이름은 홍길동입니다.\n");
	//printf("제 나이는 %d살이고요.\n", 20);
	//printf("제가 사는 곳의 번지수는 %d-%d 입니다.\n", 123, 456);

	//문제4.
	//printf("%d * %d = %d\n", 4, 5, 4*5);
	//printf("%d * %d = %d", 7, 9, 7*9);

	//EX
	//printf("문자열 출력 : [%20s]\n", "대한민국");
	//printf("문자열 출력 : [%-20s]\n", "대한민국");
	//printf("문자 출력 : [%10c]\n", 'a');
	//printf("문자 정수값 출력 : [%-10d]\n", 'a');
	//printf("오른쪽 정렬 : [%10d]\n", 1234);
	//printf("0 삽입 : [%010d]\n", 1234);
	//printf("음수의 0 삽입 : [%010d]\n", -1234);
	//printf("부동소수점 출력 : [%8.2f]\n", 123.4567);
	//printf("부동소수점 출력 : [%-8.2f]\n", 123.4567);
	//printf("부동소수점 출력 : [%10.2f]\n", 0.0012345);
	//printf("부동소수점 출력 : [%10.3e]\n", 0.0012345);
	//printf("부동소수점 출력 : [%10.7g]\n", 0.00012345);
	/* 틀림
	문자열 출력 : [                대한민국]
	문자열 출력 : [대한민국                ]
	문자 출력 : [         a]
	문자 정수값 출력:[97        ]
	오른쪽 정렬 :[      1234]
	0 삽입 : [0000001234]
	음수의 0 삽입 : [-000001234]
	부동소수점 출력 :[    123.46]
	부동소수점 출력 : [123.46    ]
	부동소수점 출력 :[      0.00]
	부동소수점 출력 :[ 1.234e-03]
	부동소수점 출력 :[0.00012345]
	*/
}